# 파이썬을 이용한 mysql

In [4]:
import pymysql

### 데이터 베이스 연결

In [5]:
database = pymysql.connect(host = 'localhost',port = 3306, user = 'root', passwd = '123456', db = 'ecommerce', charset = 'utf8')
cursor = database.cursor()
print(database)
print(cursor)

<pymysql.connections.Connection object at 0x00000279D395B3A0>
<pymysql.cursors.Cursor object at 0x00000279D395B4F0>

### 데이터 베이스에 테이블 형성

In [9]:
table = '''
    create table product(
        product_code varchar(20) not null,
        title varchar(200) not null,
        ori_price int,
        discount_price int,
        discount_percent int,
        delivery varchar(2),
        primary key(product_code)
);
'''
cursor.execute(table)
database.commit()
database.close()

## 코드 작성 순서
1. 라이브러리 import
2. 데이터 베이스 접속
3. 커서 가져오기
4. sql 문장 작성하기
5. 문장 실행
6. 데이터베이스 커밋(매번할 필요는 없음)
7. 데이터 베이스 연결 해제

### 데이터 입력

In [10]:
database = pymysql.connect(host = 'localhost',port = 3306, user = 'root', passwd = '123456', db = 'ecommerce', charset = 'utf8')
cursor = database.cursor()
sql = '''
    insert into product values('00004568','아이폰 XS',1360000,1224000,10,'F');
'''
cursor.execute(sql)
database.commit()
database.close()

In [11]:
database = pymysql.connect(host = 'localhost',port = 3306, user = 'root', passwd = '123456', db = 'ecommerce', charset = 'utf8')
cursor = database.cursor()
for i in range(10):
    product_code = 4569 + i
    sql = """
        insert into product values ('0000"""+str(product_code)+"""','아이폰 XS',1360000,1224000,10,'F')
    """
    cursor.execute(sql)
    
database.commit()
database.close()

### 데이터 출력

In [20]:
database = pymysql.connect(host = 'localhost',port = 3306, user = 'root', passwd = '123456', db = 'ecommerce', charset = 'utf8')
cursor = database.cursor()

sql = '''
    select * from product;
'''
cursor.execute(sql)    

result = cursor.fetchall()
for i in result:
    print(i)
print("====================================")
cursor.execute(sql)  
result = cursor.fetchmany(size=5)
for i in result:
    print(i)
print("====================================")
cursor.execute(sql)  
print(cursor.fetchmany())

database.close()

('00004568', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004569', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004570', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004571', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004572', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004573', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004574', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004575', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004576', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004577', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004578', '아이폰 XS', 1360000, 1224000, 10, 'F')
====================================
('00004568', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004569', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004570', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004571', '아이폰 XS', 1360000, 1224000, 10, 'F')
('00004572', '아이폰 XS', 1360000, 1224000, 10, 'F')
====================================
(('00004568', '아이폰 XS', 1360000, 1224000, 10, 'F'),)

### 데이터 업데이트

In [21]:
database = pymysql.connect(host = 'localhost',port = 3306, user = 'root', passwd = '123456', db = 'ecommerce', charset = 'utf8')
cursor = database.cursor()
sql = """
    update product set 
    title = '갤럭시 Z 플립3',
    ori_price = 1254000,
    discount_price = 1039900,
    discount_percent = 17 
    where product_code = '00004574'
    ;
"""
cursor.execute(sql)
    
database.commit()
database.close()

### 데이터 삭제

In [22]:
database = pymysql.connect(host = 'localhost',port = 3306, user = 'root', passwd = '123456', db = 'ecommerce', charset = 'utf8')
cursor = database.cursor()
sql = """
    delete from product
    where product_code = '00004578'
    ;
"""
cursor.execute(sql)
    
database.commit()
database.close()

#  Pandas 코드를 이용하여 SQL 코드 입력하기

In [5]:
import pandas as pd
import pymysql

In [19]:
db = pymysql.connect(
    host = 'localhost',
    port = 3306,
    user = 'root',
    passwd = '123456',
    db = 'sqlDB',
    charset = 'utf8'
)

In [12]:
sql = 'select * from userTbl'
df = pd.read_sql(sql,db)
df

  userID name  birthYear addr mobile1   mobile2  height       mDate
0    BBK  바비킴       1973   서울     010  00000000     176  2013-05-05
1    EJW  은지원       1972   경북     011  88888888     174  2014-03-03
2    JKW  조관우       1965   경기     016  99999999     172  2010-10-10
3    JYP  조용필       1950   경기     011  44444444     166  2009-04-04
4    KBS  김범수       1979   경남     011  22222222     173  2012-04-04
5    KKH  김경호       1971   전남     019  33333333     177  2007-07-07
6    LJB  임재범       1963   서울     016  66666666     182  2009-09-09
7    LSG  이승기       1987   서울     011  11111111     182  2008-08-08
8    SSK  성시경       1979   서울    None      None     186  2013-12-12
9    YJS  윤종신       1960   경남    None      None     170  2005-05-05

In [13]:
sql = 'select * from buyTbl'
df = pd.read_sql(sql,db)
df

    num userID prodName groupName  price  amount
0     1    KBS      운동화        의류     30       2
1     2    KBS      노트북        전자   1000       1
2     3    JYP      모니터        전자    200       1
3     4    BBK      모니터        전자    200       5
4     5    KBS      청바지        의류     50       3
5     6    BBK      메모리        전자     80      10
6     7    SSK        책        서적     15       5
7     8    EJW        책        서적     15       2
8     9    EJW      청바지        의류     50       1
9    10    BBK      운동화        의류     30       2
10   11    EJW        책        서적     15       1
11   12    BBK      운동화        의류     30       2

### 에러 발생 코드
cursor = db.cursor()

sql = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('LJH', '운동화', '의류', 30, 2);"

cursor.execute(sql)

db.commit()

buyRbl 에서의 userID는 userTbl의 userID를 참조하기 때문에 userTbl에 없는 ID는 작성할 수 없다.

In [16]:
sql = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('BBK', '운동화', '의류', 30, 2);"
cursor.execute(sql)
db.commit()

In [20]:
sql = "INSERT INTO userTbl VALUES('LJH', '이진하', 1996, '경북', '011', '00000000', 171, '2014-4-4');"
cursor.execute(sql)
db.commit()

In [21]:
sql = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('LJH', '운동화', '의류', 30, 2);"
cursor.execute(sql)
db.commit()

### 에러 발생 코드
sql = "DELETE FROM userTbl WHERE userID = 'LJH'"

cursor.execute(sql)

db.commit()

buyRbl 에서 참조하는 userID는 userTbl에서 userID를 삭제할 수 없다